# Business Intelligence Fall 2023 Exam Project

This project is designed as experimental research and development of BI implementation solution. It involves systematic and creative work of finding novel, uncertain, and reproducible results by applying modern BI and artificial intelligence (AI) technologies in a context. 

The development workflow goes through four stages and milestones, each of which has an objective, tasks,
and deliverables.

## Stage 1: Problem Definition
### Objective: Foundation of a business case and problem statement

https://www.kaggle.com/datasets/arnabchaki/data-science-salaries-2023/data

1. At this stage you brainstorm, browse sources of inspiration and information, collect ideas and discuss business or social domains, where BI and AI can bring a value.
2. Choose one of your ideas and define context, purpose, research questions, and hypotheses for a BI problem statement. Write a brief annotation of your project, in about four sentences, explaining:
     - which challenge you would like to address?
     - why is it important or interesting research goal?
     - what is the expected solution your project would provide?
     - what would be the impact of the solution and which category of users could benefit from it?
3. Prepare the development environment
     - give a title to your project
     - plan and organise the execution of the individual tasks in terms of time, milestones, deliverables, team members engagement
     - prepare the development platform and procedures – Github repository, IDE, software tools
4. Create and upload the initial project document with the information from above in a .md file in your repository as an initial release of the project.

## Stage 2: Data Preparation
### Objective: Data collection, exploration and pre-processing
Based on the ideas and assumptions defined at the previous stage:
1. Collect and load relevant data from various sources
2. Clean and integrate the collected data in appropriate data structures. Apply any transformations needed for the integration and the operations - ETL (Extract Transform Load) or ELT (Extract Load Transform).
3. Explore the data by applying measures from statistics to discover its basic features. Create charts and diagrams to visualize the features for better understanding and support of further decisions.
4. Apply the necessary pre-processing to prepare the data for machine learning analysis, ensuring that the data is:
    - Meaningful – describes relevant and correctly measured features and observations.
    - Sufficient – describes various cases and feature occurrences, decided by testing.
    - Shaped – presented in a structure, appropriate for processing by machine learning algorithms.
    - Cleaned – repaired from missing values and outliners.
    - Scaled – transform data distributions in comparable scales, when necessary.
    - Engineered – analyse all features and select the most informative for further processing.
    
Export your initial version of the solution to the Github repository.

## Stage 3: Solution Prototype
### Objective: Using data and analysis for building predictive models
Extend the data analysis by implementing machine learning and deep learning methods and algorithms.
1. Select relevant methods that could solve the problem. Train, test and validate data models by use of
supervised and unsupervised methods, neural networks or graphs.
2. Select and apply appropriate measures for assessing the quality of your models. Iterate the process to
explore possibilities for improvement the quality of the models.

Publish the new version of your solution in Github as a prototype.

## Stage 4: Visualisation, Explanation and Usability Evaluation
### Objective: Present the process and the results of the analysis in human-understandable form
Extend your solution with visualisation, explanation and interpretation of the results:
1. Design and develop visual representation of the data, the analysis process, the applied methods and usage
scenarios. Consider the use of animation, 3D or VR visualisation, as appropriate.
2. Create a simple visual interface of the application to make it accessible and interactive for other users.
3. Present the visualised prototype to potential users for usability evaluation. Take notes and implement the
relevant feedback outcomes. Elaborate on the benefits of applying visualisation and explanation
techniques for data analytics.

Revise, complete, and deliver the final solution to Github and a link to it in Wiseflow.

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [49]:
#Dresen Links:
#df_travel= pd.read_csv('../../../../OneDrive/Dokumenter/GitHub/github-bi/BI-Fall-2023-Exam-Project/Data/traveldistmin.csv')
#df_infl= pd.read_csv('../../../../OneDrive/Dokumenter/GitHub/github-bi/BI-Fall-2023-Exam-Project/Data/US_inflation_rates.csv')
#df_remoteWork = pd.read_excel('../../../../OneDrive/Dokumenter/GitHub/github-bi/BI-Fall-2023-Exam-Project/Data/statistic_id1356325_us-workers-working-hybrid-or-remote-vs-on-site-2019-q4-2022.xlsx', sheet_name='Data')
#df_happiness = pd.read_excel('../../../../OneDrive/Dokumenter/GitHub/github-bi/BI-Fall-2023-Exam-Project/Data/statistic_id1111316_struggles-with-working-remotely-2020-2022.xlsx', sheet_name='Data')
#df = pd.read_csv('../../../../OneDrive/Dokumenter/GitHub/github-bi/BI-Fall-2023-Exam-Project/Data/ds_salaries2.csv')

In [32]:
df_remoteWork = pd.read_excel('../../../Documents/GitHub/BI-Fall-2023-Exam-Project/Data/statistic_id1356325_us-workers-working-hybrid-or-remote-vs-on-site-2019-q4-2022.xlsx', sheet_name='Data')
df_remoteWork.head()

    Period  Hybrid  Remote  On-site
0     2019      32       8       60
1  Q2 2020      18      70       12
2  Q2 2021      31      48       21
3  Q1 2022      42      39       19
4  Q2 2022      49      29       22

In [35]:
#df_travel= pd.read_csv('../../../Documents/GitHub/BI-Fall-2023-Exam-Project/Data/traveldistmin.csv')
#df_infl= pd.read_csv('../../../Documents/GitHub/BI-Fall-2023-Exam-Project/Data/US_inflation_rates.csv')
#df_remoteWork = pd.read_excel('../../../Documents/GitHub/BI-Fall-2023-Exam-Project/Data/statistic_id1356325_us-workers-working-hybrid-or-remote-vs-on-site-2019-q4-2022.xlsx', sheet_name='Data')
#df_happiness = pd.read_excel('../../../Documents/GitHub/BI-Fall-2023-Exam-Project/Data/statistic_id1111316_struggles-with-working-remotely-2020-2022.xlsx', sheet_name='Data')
df = pd.read_csv('../../../Documents/GitHub/BI-Fall-2023-Exam-Project/Data/ds_salaries2.csv')
df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location
0,0,2023,SE,FT,Principal Data Scientist,85847,ES,100,ES
1,1,2023,MI,CT,ML Engineer,30000,US,100,US
2,2,2023,MI,CT,ML Engineer,25500,US,100,US
3,3,2023,SE,FT,Data Scientist,175000,CA,100,CA
4,4,2023,SE,FT,Data Scientist,120000,CA,100,CA

In [36]:
#new_df = df[['TRVLCMIN','TRPMILES']]
#new_df=df.drop(['salary', 'salary_currency', 'company_size'], axis = 1)
#new_df.to_csv('/Users/emiliocastrolagunas/Documents/GitHub/BI-Fall-2023-Exam-Project/Data/ds_salaries2.csv') #gemmer til fil
#new_df.to_csv('../../../Documents/GitHub/BI-Fall-2023-Exam-Project/Data/ds_salaries2.csv')
new_df=df

In [37]:
new_df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location
0,0,2023,SE,FT,Principal Data Scientist,85847,ES,100,ES
1,1,2023,MI,CT,ML Engineer,30000,US,100,US
2,2,2023,MI,CT,ML Engineer,25500,US,100,US
3,3,2023,SE,FT,Data Scientist,175000,CA,100,CA
4,4,2023,SE,FT,Data Scientist,120000,CA,100,CA

In [38]:
sal_df = new_df[df['employee_residence'].str.contains('US')]

In [40]:
sal_df=sal_df.drop(['Unnamed: 0'], axis=1)
sal_df.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location
1,2023,MI,CT,ML Engineer,30000,US,100,US
2,2023,MI,CT,ML Engineer,25500,US,100,US
5,2023,SE,FT,Applied Scientist,222200,US,0,US
6,2023,SE,FT,Applied Scientist,136000,US,0,US
9,2023,SE,FT,Data Scientist,147100,US,0,US

In [41]:
sal_df.reset_index(drop=True, inplace=True)

In [42]:
non_us_locations = sal_df[~sal_df['company_location'].str.contains('US')]
non_us_locations

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location
1833,2022,SE,FT,Data Analyst,171000,US,100,AU
1900,2022,EN,FT,3D Computer Vision Researcher,50000,US,100,CR
2460,2022,EN,FT,Data Scientist,50000,US,50,DE
2977,2021,SE,FT,Machine Learning Scientist,225000,US,100,CA
2988,2021,SE,FT,Data Science Manager,152000,US,100,FR

In [43]:
sal_df

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location
0,2023,MI,CT,ML Engineer,30000,US,100,US
1,2023,MI,CT,ML Engineer,25500,US,100,US
2,2023,SE,FT,Applied Scientist,222200,US,0,US
3,2023,SE,FT,Applied Scientist,136000,US,0,US
4,2023,SE,FT,Data Scientist,147100,US,0,US
...,...,...,...,...,...,...,...,...
2999,2021,SE,FT,Data Specialist,165000,US,100,US
3000,2020,SE,FT,Data Scientist,412000,US,100,US
3001,2021,MI,FT,Principal Data Scientist,151000,US,100,US
3002,2020,EN,FT,Data Scientist,105000,US,100,US
3003,2020,EN,CT,Business Data Analyst,100000,US,100,US

work_year - The year the salary was paid.

experience_level - The experience level in the job during the year with the following possible values: EN Entry-level / Junior MI Mid-level / Intermediate SE Senior-level / Expert EX Executive-level / Director

employment_type - The type of employement for the role: PT Part-time FT Full-time CT Contract FL Freelance

job_title - The role worked in during the year.

salary - The total gross salary amount paid.

salary_currency - The currency of the salary paid as an ISO 4217 currency code.

salary_in_usd - The salary in USD (FX rate divided by avg. USD rate for the respective year via fxdata.foorilla.com).

employee_residence - Employee's primary country of residence in during the work year as an ISO 3166 country code.

remote_ratio - The overall amount of work done remotely, possible values are as follows: 0 No remote work (less than 20%) 50 Partially remote 100 Fully remote (more than 80%)

company_location - The country of the employer's main office or contracting branch as an ISO 3166 country code.

company_size - The average number of people that worked for the company during the year: S less than 50 employees (small) M 50 to 250 employees (medium) L more than 250 employees (large)

In [13]:
df_travel= pd.read_csv('../../../Documents/GitHub/BI-Fall-2023-Exam-Project/Data/traveldistmin.csv')
df_travel=df_travel.drop(['Unnamed: 0'], axis=1)
df_travel.head()

   TRVLCMIN  TRPMILES
0        15     5.244
1        20     5.149
2       120    84.004
3       150    81.628
4        15     2.250

In [14]:
df_travel.describe()
#The extreme values should be taken into account in this  analysis
#For example, high extreme values would be an indicator of remote working being a positive
#Negative values doesnt make any sense.

            TRVLCMIN       TRPMILES
count  923572.000000  923572.000000
mean       21.557486      11.436043
std        32.884552      74.559992
min        -9.000000      -9.000000
25%         8.000000       1.335000
50%        15.000000       3.443000
75%        25.000000       8.743000
max      1200.000000    9621.053000

In [17]:
column_name1 = 'TRVLCMIN' 
column_name2 = 'TRPMILES' 

median_value1 = df_travel[column_name1].median()
median_value2 = df_travel[column_name2].median()

# Use a boolean mask to identify negative values and replace them with the median
df_travel[column_name1] = df_travel[column_name1].apply(lambda x: median_value1 if x < 0 else x)
df_travel[column_name2] = df_travel[column_name2].apply(lambda x: median_value2 if x < 0 else x)
df_travel.describe()

            TRVLCMIN       TRPMILES
count  923572.000000  923572.000000
mean       21.591189      11.444881
std        32.865509      74.558307
min         0.000000       0.000000
25%         8.000000       1.340000
50%        15.000000       3.443000
75%        25.000000       8.743000
max      1200.000000    9621.053000